/* 
  Localizable.strings
  roi

  Created by Ryo Kawamura on 2022/10/23.
  Copyright © 2022 Waysify. All rights reserved.
*/

// App menu
"About RectLabel" = "RectLabelについて";
"Purchase license" = "ライセンスを購入";
"Buy RectLabel" = "RectLabelを購入";
"Please buy RectLabel" = "RectLabelをご購入ください";
"We are supporting your feature requests." = "あなたの機能リクエストをサポートしています。";
"Edit subscription" = "サブスクリプションを編集";
"Report issues" = "問題を報告";
"Write a review" = "レビューを書く";
"Settings" = "設定";
"Export settings file" = "設定ファイルをエクスポート";
"Import settings file" = "設定ファイルをインポート";
"Locate settings file" = "設定ファイルの場所";
"Settings file location" = "設定ファイルの場所";
"Open app folder" = "アプリフォルダを開く";
"Hide RectLabel" = "RectLabelを非表示";
"Hide Others" = "他を非表示";
"Show All" = "全て表示";
"Quit RectLabel" = "RectLabelを終了";

// File menu
"File" = "ファイル";
"Open images folder and annotations folder" = "画像フォルダとアノテーションフォルダを開く";
"Open images folder" = "画像フォルダを開く";
"Open a folder which includes a yaml file" = "yamlファイルを含むフォルダを開く";
"Remove EXIF orientation flags" = "EXIF方向フラグを削除";
"Rename image" = "画像名を変更";
"Resize images" = "画像をリサイズ";
"Next image" = "次の画像";
"Next image with a step 1" = "次の画像";
"Next image with a step 10" = "１０画像単位で次の画像";
"Prev Image" = "前の画像";
"Prev image with a step 1" = "前の画像";
"Prev image with a step 10" = "１０画像単位で前の画像";
"Jump to image number" = "画像番号を指定";
"Copy images" = "画像をコピー";
"Move images" = "画像を移動";
"Delete images" = "画像を削除";
"Current image" = "現在の画像";
"All images" = "全ての画像";
"Save" = "保存";
"Close folder" = "フォルダを閉じる";

// Export menu
"Export" = "エクスポート";
"Export CreateML JSON file" = "CreateML JSONファイルをエクスポート";
"Import CreateML JSON file" = "CreateML JSONファイルをインポート";
"Export COCO JSON file" = "COCO JSONファイルをエクスポート";
"Import COCO JSON file" = "COCO JSONファイルをインポート";
"Import COCO RLE JSON files" = "COCO RLE JSONファイルをインポート";
"Export YOLO txt files" = "YOLO textファイルをエクスポート";
"Import YOLO txt files" = "YOLO textファイルをインポート";
"Export DOTA txt files" = "DOTA textファイルをエクスポート";
"Import DOTA txt files" = "DOTA textファイルをインポート";
"Export CSV file" = "CSVファイルをエクスポート";
"Import CSV file" = "CSVファイルをインポート";
"Export object names file" = "物体名ファイルをエクスポート";
"Import object names" = "物体名ファイルをインポート";
"from a file" = "ファイルから";
"from all xml files" = "全てのxmlファイルから";
"Export mask images" = "マスク画像をエクスポート";
"Import Cellpose 16bit PNG files" = "Cellpose 16bit PNGファイルをインポート";
"Export screenshots" = "スクリーンショットをエクスポート";
"Export train/val/test folders" = "学習/検証/テストフォルダをエクスポート";
"Export images for classification" = "分類用に画像をエクスポート";
"Split to train/val/test folders" = "学習/検証/テストフォルダに分割";
"train/val/test ratio" = "学習/検証/テストの比率";
"Export objects and attributes stats" = "物体名と属性名の統計をエクスポート";
"Convert video to image frames" = "ビデオファイルを画像ファイルに変換";
"Export augmented images" = "拡張画像をエクスポート";
"Export sliced images" = "スライス画像をエクスポート";
"Horizontal slices" = "水平スライス";
"Vertical slices" = "垂直スライス";

// Edit menu
"Edit" = "編集";
"Create box" = "境界ボックスを作成";
"Create box using Tracking" = "トラッキングを使用して境界ボックスを作成";
"Create polygon" = "多角形を作成";
"Create polygon using SAM" = "SAMを用いて多角形を作成";
"Create polygon using SAM3" = "SAM3を用いて多角形を作成";
"Create cubic bezier" = "３次ベジェ曲線を作成";
"Create line" = "線分を作成";
"Create point" = "点を作成";
"Create keypoints" = "キーポイントを作成";
"Create pixels" = "ピクセルマスクを作成";
"Create image label" = "画像ラベルを作成";
"Move" = "移動";
"Rotate" = "回転";
"Rotate the image right" = "画像を右へ回転";
"Rotate the image left" = "画像を左へ回転";
"Delete" = "削除";
"Layer up" = "レイヤーを１つ上げる";
"Layer down" = "レイヤーを１つ下げる";
"Toggle erase" = "消去切り替え";
"Change brightness and contrast" = "明るさコントラスト補正";
"Change object color" = "物体色を変更";
"Clear object color" = "物体色を初期化";
"Search images" = "検索";
"Clear search images" = "検索結果をクリア";
"Create memo" = "メモを作成";
"Replace labels" = "ラベル名を置換";
"Undo" = "元に戻す";
"Redo" = "やり直す";
"Copy" = "コピー";
"Cut" = "カット";
"Paste" = "貼り付け";
"Select All" = "全て選択";

// CoreML
"Load CoreML Model" = "CoreMLモデルを読み込む";
"Auto labeling" = "自動ラベリング";
"Auto text recognition" = "自動テキスト認識";
"Toggle auto process" =  "自動処理を切り替え";
"Search incorrectly predicted images" = "誤って予測された画像を検索";

// View
"View" = "表示";
"Zoom in" = "ズームイン";
"Zoom out" = "ズームアウト";
"Zoom fit" = "ズームクリア";
"Focus box" = "ズームフォーカス";
"Hide image name" = "画像名を非表示";
"Hide other boxes" = "他物体を非表示";
"Hide SAM3 boxes" = "SAM3ボックスを非表示";
"Hide cross hairs" = "十字線を非表示";
"Hide keypoints names" = "キーポイント名を非表示";
"Hide keypoints boxes" = "キーポイントボックスを非表示";
"Hide pixels" = "ピクセルマスクを非表示";
"Hide superpixels" = "スーパーピクセルを非表示";
"Show small pixels" = "小さいピクセルを表示";
"Show other pixels" = "他ピクセルマスクを表示";
"Show polygon smooth scrollbar" = "多角形スムーズスクロールバーを表示";
"Show labels on boxes" = "物体名を表示";
"Show coordinates on boxes" = "XY座標を表示";
"Show indexes on points" = "点に番号を表示";
"Show indexes on labels table" = "ラベルテーブルに番号を表示";
"Show checkboxes on labels table" = "ラベルテーブルにチェックボックスを表示";
"Show image full path" = "画像のフルパスを表示";
"Show depth image" = "深さ画像を表示";
"Reload the image" = "現在の画像を再度読み込む";
"Enter gallery view" = "ギャラリー表示";
"Enter full screen" = "フルスクリーン表示";
"Set window size" = "ウィンドウサイズを設定";

// Help
"Help" = "ヘルプ";
"RectLabel Help" = "RectLabel ヘルプ";

// hotkeys
"Copy image to another folder" = "画像を別のフォルダへコピー";
"Move image to another folder" = "画像を別のフォルダへ移動";
"Delete image" = "画像を削除";
"Auto labeling the image" = "現在の画像を自動ラベリング";

// purchase
"This is a free trial version, and although the trial is untimed, a license must be purchased for continued use." = "これは無料試用版であり、試用期間に制限はありませんが、継続して使用するにはライセンスを購入する必要があります。";
"We offer subscriptions and one-time payment." = "サブスクリプションと一括払いを提供しています。";
"Terms of Use" = "利用規約";
"Privacy Policy" = "プライバシーポリシー";
"Restore request failed" = "購入復元に失敗しました";
"Thanks for subscribing." = "ご購入頂き有難うございます。";
"Subscribing failed." = "登録に失敗しました。";
"Restore purchases" = "購入を復元";
"Restored no items." = "復元されたアイテムはありません。";
"Restored." = "復元されました。";
"Month" = "月";
"Year" = "年";
"One-time payment" = "一括払い";

// settings
"Projects" = "プロジェクト";
"Objects" = "物体";
"Attributes" = "属性";
"Hotkeys" = "ホットキー";
"Label fast" = "高速";
"Primary" = "使用";
"Key" = "キー";
"Name" = "名前";
"Color" = "色";
"Hide" = "非表示";
"Hotkey" = "ホットキー";
"Add" = "追加";
"Prefix" = "接頭語";
"Type" = "タイプ";
"Single select" = "単一選択";
"Multiple select" = "複数選択";
"Text input" = "テキスト入力";
"Number input" = "数値入力";
"Items" = "アイテム";
"Restore hotkeys" = "初期化";
"Save as jpg" = "画像として保存";
"Auto save" = "自動保存";
"Auto copy from previous image" = "前の画像から自動コピー";
"Skip backup dialog when overwrite" = "上書き時にバックアップダイアログをスキップ";
"Clear existing labels when auto label all images" = "全ての画像に自動ラベルを付けるときに既存ラベルをクリアする";
"Skip label dialog when create" = "作成時にダイアログをスキップ";
"Close label dialog when select" = "物体選択時にダイアログを閉じる";
"Change label when press an object/attribute hotkey" = "物体/属性ホットキーを押したときにラベルを変更する";
"Add an image label when press an object hotkey" = "物体ホットキーを押したときに画像ラベルを追加する";
"Use 1-click buttons" = "ワンクリックボタンを使用";
"Maintain zoom and position" = "画像変更時にズームと位置を維持";
"Clear" = "クリア";
"Label format" = "ラベルフォーマット";
"Use truncated, occluded, and difficult tags" = "truncated, occluded, difficultタグを使用";
"Rotate boxes as rotated boxes when augment" = "拡張時にボックスを回転ボックスとして回転";
"Separate merged polygons when read YOLO format" = "YOLO形式で読み込むときに結合されたポリゴンを分離";
"Save confidence values when YOLO format" = "YOLO形式時に信頼値を保存する";
"Save as floating-point values" = "小数点で座標値を保存";
"Do not move image position" = "画像位置を固定";
"Show circle edit points" = "編集点を円形で表示";
"Show all edit points" = "全ての編集点を表示";
"Show edit points between box corners" = "ボックスのコーナー間に編集点を表示";
"Show the first point of the box" = "ボックスの最初の点を表示";
"Click 4 points when draw boxes" = "ボックス描画時に４点クリックする";
"Use English as an app language" = "アプリ言語として英語を使用";
"Sort images" = "画像名で並べる";
"Alphabetic" = "アルファベット順";
"Numeric" = "番号順";
"Last modified" = "変更日時";
"Sort alphabetically" = "アルファベット順に並べる";

// open folder
"Open folder" = "フォルダを開く";
"Click Open folder button on the upper-left corner." = "左上隅のフォルダを開くボタンをクリックします。";
"Cannot get url from bookmark" = "ブックマークからURLを取得できません";
"Cannot get bookmark from url" = "URLからブックマークを取得できません";
"The folder is stale." = "フォルダーが古いです。";
"Images not found" = "画像が見つかりません";
"Open folders which include images." = "画像が含まれるフォルダを開いてください。";
"Create folder error" = "フォルダ作成エラー";
"Images folder" = "画像フォルダ";
"Annotations folder" = "アノテーションフォルダ";
"Read images folder recursively" = "画像フォルダを再帰的に読む";

// copy, move, backup
"Move image" = "画像を移動";
"Copy image" = "画像をコピー";
"Back up label files" = "アノテーションをバックアップ";
"Back up images" = "画像をバックアップ";
"Back up depth images" = "深さ画像をバックアップ";
"Copy file error" = "ファイルコピーエラー";
"Delete file error" = "ファイル削除エラー";

// export, import
"Open the folder to save." = "保存するフォルダを開きます。";
"Open the mask image file." = "ピクセルマスク画像を開きます。";
"Open the JSON file." = "JSONファイルを開きます。";
"Open the folder which includes Cellpose 16bit PNG files." = "Cellpose 16bit PNGファイルを含むフォルダを開きます。";
"Open the folder which includes COCO RLE JSON files." = "COCO RLE JSONファイルを含むフォルダを開きます。";
"Open the folder which includes png files." = "pngファイルを含むフォルダを開きます。";
"Open the folder which includes YOLO text files." = "YOLO textファイルを含むフォルダを開きます。";
"Open the folder which includes DOTA text files." = "DOTA textファイルを含むフォルダを開きます。";
"Add or import object names" = "物体名を追加またはインポートしてください";
"These object names are not found on objects table." = "これらの物体名は物体テーブルにありません。";
"Unknown" = "不明";
"Video format error" = "ビデオフォーマットエラー";
"This file does not contain video." = "このファイルにはビデオが含まれていません。";
"yaml file as dictionary" = "辞書形式のyamlファイル";
"yaml file as array" = "配列形式のyamlファイル";
"Full path" = "ファイルパス";
"File name" = "ファイル名";
"Names file" = "名前ファイル";
"Export only used names" = "使用された名前のみをエクスポート";
"Export mask images" = "マスク画像をエクスポート";
"Export a Cellpose 16bit PNG file" = "Cellpose 16bit PNGファイルをエクスポート";
"Export an image includes all objects" = "全ての物体を含むマスク画像";
"Export an image per object" = "各物体を含むマスク画像";
"Export an image per object class" = "各物体クラスを含むマスク画像";
"Object Detection" = "物体検出";
"Multi-Label Classification" = "マルチラベル分類";
"Model type" = "モデルタイプ";
"Image type" = "画像タイプ";
"Whole image" = "全体画像";
"Cropped image" = "切り抜き画像";
"image" = "画像";
"label" = "ラベル";
"Flip horizontally" = "左右反転";
"Crop the image" = "画像クロッピング";
"Change contrast" = "コントラスト変更";
"Rotate the image" = "画像回転";
"degrees" = "度";
"Number of augmented images" = "拡張画像数";
"Output images folder" = "保存先画像フォルダ";
"Output annotations folder" = "保存先アノテーションフォルダ";
"Move images to folder" = "画像をフォルダに移動";
"Move annotations to folder" = "アノテーションをフォルダに移動";
"Copy images to folder" = "画像をフォルダにコピー";
"Copy annotations to folder" = "アノテーションをフォルダにコピー";
"Backup images to folder" = "画像をフォルダにバックアップ";
"Backup annotations to folder" = "アノテーションをフォルダにバックアップ";
"Resize images" = "画像をリサイズ";
"Image size" = "画像サイズ";
"Width" = "幅";
"Height" = "高さ";
"Change" = "変更";
"Text before replace" = "置換前の文字列";
"Text after replace" = "置換後の文字列";
"Video file" = "ビデオファイル";
"Output folder" = "出力フォルダ";
"Frames per second" = "1秒あたりのフレーム数";
"Frame suffix" = "フレーム接尾語";
"Keypoint name" = "キーポイント名";

// edit
"Create" = "作成";
"Add a point forward" = "前方にポイントを追加";
"Add a point backward" = "後方にポイントを追加";
"Delete this point" = "このポイントを削除";
"Set to the first point" = "最初のポイントに設定";
"Point size up" = "ポイントサイズアップ";
"Point size down" = "ポイントサイズダウン";
"Make visible" = "表示";
"Make not labeled" = "ラベリングしないで非表示";
"Make labeled but not visible" = "ラベリングするが非表示";
"Delete edge" = "エッジを削除";
"Change keypoint name" = "キーポイント名を変更";
"Change keypoint color" = "キーポイント色を変更";
"Toggle positive and negative" = "正と負を切り替え";
"Convert to polygon" = "多角形へ変換";
"Convert to box using SAM" = "SAMを使用してボックスに変換";
"Convert to polygon using SAM" = "SAMを使用して多角形に変換";
"Convert to pixels using SAM" = "SAMを使用してピクセルマスクに変換";
"Convert to mask" = "ピクセルマスクへ変換";
"Convert to cubic bezier" = "３次ベジェ曲線へ変換";
"Convert to rotated box" = "回転ボックスへ変換";
"Convert to bounding box" = "境界ボックスに変換";
"Set bounding box from the next polygon" = "次のポリゴンから境界ボックスを設定";
"Clear all keypoints" = "全てのキーポイントをクリア";
"Flood fill" = "塗りつぶし";
"Clear pixels" = "ピクセルマスクをクリア";
"Import pixels" = "ピクセルマスクをインポート";
"Focus" = "ズームフォーカス";
"Merge boxes" = "ボックスを結合";
"Merge polygons" = "ポリゴンを結合";
"Merge pixels" = "ピクセルマスクを結合";
"Separate polygons" = "ポリゴンを分割";
"Copy as erase mask" = "消去マスクとしてコピー";
"Copied as erase mask" = "消去マスクとしてコピーしました";
"Cut using erase mask" = "消去マスクを使用してカット";
"Start SAM preprocessing" = "SAM前処理を開始";
"Start SAM3 preprocessing" = "SAM3前処理を開始";
"Convert to box using SAM" = "SAMを使用して境界ボックスに変換";
"Brushes" = "ブラシ";
"Superpixels" = "スーパーピクセル";
"object" = "物体";
"Size" = "サイズ";
"Box" = "四角形";
"Rotated box" = "回転ボックス";
"Auto" = "自動処理";
"Polygon" = "多角形";
"Erase" = "消去";
"Erase polygon" = "多角形を消去";
"Erase points" = "点を消去";
"Erase mask" = "マスクを消去";
"Model" = "モデル";
"Smooth" = "なめらかさ";
"Positive point" = "プラス点";
"Negative point" = "マイナス点";
"Pixels" = "ピクセルマスク";
"Text" = "テキスト";
"Use" = "使用";
"Positive" = "前景";
"Negative" = "背景";
"Threshold" = "しきい値";
"Downloading the model..." = "モデルをダウンロード中...";
"Downloading failed..." = "ダウンロードに失敗しました...";
"Preprocessing the image..." = "画像を前処理中...";
"Preprocessing failed..." = "前処理に失敗しました...";
"Ready to click points" = "ポイントをクリックする準備ができました";
"found." = "見つかりました。";
"Encoding the image..." = "画像をエンコードしています...";
"Encoding image failed..." = "画像のエンコードに失敗しました...";
"Encoding the text..." = "テキストをエンコードしています...";
"Encoding text failed..." = "テキストのエンコードに失敗しました...";
"Encoding boxes..." = "ボックスをエンコードしています...";
"Encoding boxes failed..." = "ボックスのエンコードに失敗しました...";
"Decoding..." = "デコードしています...";
"Create polygon using Cellpose" = "Cellposeを使用して多角形を作成";
"Channels" = "チャンネル";
"Red" = "赤";
"Green" = "緑";
"Blue" = "青";
"Diameter" = "直径";
"Flow threshold" = "フロー閾値";
"Min size" = "最小サイズ";
"Smoothness" = "スムーズ";
"Brightness" = "明るさ";
"Contrast" = "コントラスト";
"Label" = "ラベル";
"Search" = "検索対象";
"label name" = "ラベル名";
"image name" = "画像名";
"Press enter key to finish SAM3." = "Enterキーを押してSAM3を終了します。";
"Press enter key to finish drawing" = "エンターキーを押して描画を終了します";
"Tracking needs labels on previous image." = "トラッキングには前の画像のラベルが必要です。";

// CoreML
"macOS version error" = "macOSのバージョンエラー";
"macOS version has to be GTE 10.13." = "macOSのバージョンは10.13以上である必要があります。";
"macOS version has to be GTE 10.15." = "macOSのバージョンは10.15以上である必要があります。";
"compileModelAtURL error" = "compileModelAtURLエラー";
"modelWithContentsOfURL error" = "modelWithContentsOfURLエラー";
"Load CoreML model before processing." = "処理前にCoreMLモデルを読み込んでください。";
"Loaded the CoreML model" = "CoreMLモデルを読み込みました";
"VNCoreMLModel error" = "VNCoreMLModelエラー";
"performRequests error" = "performRequestsエラー";
"VNCoreMLRequest error" = "VNCoreMLRequestエラー";
"VNRecognizeTextRequest error" = "VNRecognizeTextRequestエラー";
"Do you want to overwrite the current depth image?" = "深度画像を上書きしますか?";
"Confidence" = "信頼度";
"Overlap" = "重複度";
"Language" = "言語";
"Line" = "行";
"Word" = "単語";
"Not detected" = "検出されず";
"Not classified" = "分類されず";
"Falsely detected" = "誤検出";
"Filter by class" = "クラスフィルター";

// view
"orientation" = "向き";
"Copied image name" = "画像名をコピーしました";

// dialog
"Cancel" = "キャンセル";
"Confirm" = "確認";
"Start" = "開始";
"Do you want to save the changes?" = "変更を保存しますか?";
"Do you want to delete the current image?" = "現在の画像を削除しますか？";
"Do you want to delete all images?" = "すべての画像を削除しますか?";
"Do not save" = "保存しない";
"Save error" = "保存エラー";
"Error" = "エラー";
"Parse error" = "解析エラー";
"JSON parse error" = "JSON解析エラー";
"XML parse error" = "XML解析エラー";
"The size tag could not be parsed correctly." = "サイズタグを正しく解析できませんでした。";
"Status" = "状態";
"Alert" = "アラート";

// status
"Backing up..." = "バックアップ中...";
"Reading images..." = "画像を読み込み中...";
"Sorting images..." = "画像をソート中...";
"Reading labels..." = "アノテーションを読み込み中...";
"Indexing labels..." = "アノテーションをインデクシング中...";
"Indexing objects..." = "物体名をインデクシング中...";
"Indexing attributes..." = "属性名をインデクシング中...";
"Processing..." = "処理中...";
"Creating a new names list..." = "新しい名前リストを作成しています...";
"Finished processing." = "処理が終了しました。";
"Not found." = "見つかりません。";
